dfc = common.extract_as_df(path_week_master, bucket_name)       nenshudo  nendo  shudo  minashi_tsuki  week_from_ymd  week_to_ymd  \
0       200301   2003      1              3       20030224     20030302   
1       200302   2003      2              3       20030303     20030309   
2       200303   2003      3              3       20030310     20030316   
3       200304   2003      4              3       20030317     20030323   
4       200305   2003      5              3       20030324     20030330   
...        ...    ...    ...            ...            ...          ...   
1456    203048   2030     48              1       20310120     20310126   
1457    203049   2030     49              2       20310127     20310202   
1458    203050   2030     50              2       20310203     20310209   
1459    203051   2030     51              2       20310210     20310216   
1460    203052   2030     52              2       20310217     20310223   

      znen_nendo  znen_shudo  znen_week_from_ymd  znen_week_to_ymd  \
0           2002           1            20020225          20020303   
1           2002           2            20020304          20020310   
2           2002           3            20020311          20020317   
3           2002           4            20020318          20020324   
4           2002           5            20020325          20020331   
...          ...         ...                 ...               ...   
1456        2029          48            20300121          20300127   
1457        2029          49            20300128          20300203   
1458        2029          50            20300204          20300210   
1459        2029          51            20300211          20300217   
1460        2029          52            20300218          20300224   

      znen_minashi_tsuki  
0                      3  
1                      3  
2                      3  
3                      3  
4                      3  
...                  ...  
1456                   1  
1457                   2  
1458                   2  
1459                   2  
1460                   2  






dfc = common.extract_as_df(path_week_master, bucket_name)       nenshudo  nendo  shudo  minashi_tsuki  week_from_ymd  week_to_ymd  \
0       200301   2003      1              3       20030224     20030302   
1       200302   2003      2              3       20030303     20030309   
2       200303   2003      3              3       20030310     20030316   
3       200304   2003      4              3       20030317     20030323   
4       200305   2003      5              3       20030324     20030330   
...        ...    ...    ...            ...            ...          ...   
1456    203048   2030     48              1       20310120     20310126   
1457    203049   2030     49              2       20310127     20310202   
1458    203050   2030     50              2       20310203     20310209   
1459    203051   2030     51              2       20310210     20310216   
1460    203052   2030     52              2       20310217     20310223   

      znen_nendo  znen_shudo  znen_week_from_ymd  znen_week_to_ymd  \
0           2002           1            20020225          20020303   
1           2002           2            20020304          20020310   
2           2002           3            20020311          20020317   
3           2002           4            20020318          20020324   
4           2002           5            20020325          20020331   
...          ...         ...                 ...               ...   
1456        2029          48            20300121          20300127   
1457        2029          49            20300128          20300203   
1458        2029          50            20300204          20300210   
1459        2029          51            20300211          20300217   
1460        2029          52            20300218          20300224   

      znen_minashi_tsuki  
0                      3  
1                      3  
2                      3  
3                      3  
4                      3  
...                  ...  
1456                   1  
1457                   2  
1458                   2  
1459                   2  
1460                   2  






df_bunrui = common.extract_as_df(path_bunrui, bucket_name)       sbu_cd       sbu_nm  jigyobu_cd    jigyobu_nm  dpt_cd    dpt_nm  \
0          1  ライフスタイル事業本部           1  インテリア・ファニシング      60        収納   
1          1  ライフスタイル事業本部           1  インテリア・ファニシング      60        収納   
2          1  ライフスタイル事業本部           1  インテリア・ファニシング      60        収納   
3          1  ライフスタイル事業本部           1  インテリア・ファニシング      60        収納   
4          1  ライフスタイル事業本部           1  インテリア・ファニシング      60        収納   
...      ...          ...         ...           ...     ...       ...   
2294       9           本部          98        その他事業部      80       用度品   
2295       9           本部          98        その他事業部      80       用度品   
2296       9           本部          98        その他事業部      80       用度品   
2297       9           本部          98        その他事業部      98  カインズ　コート   
2298       9           本部          98        その他事業部      99      売上除外   

      line_cd   line_nm  cls_cd       cls_nm  
0         602    キッチン収納    6020          ワゴン  
1         602    キッチン収納    6021        スキマ収納  
2         603      衣類収納    6030        押入れ収納  
3         603      衣類収納    6031     クローゼット収納  
4         603      衣類収納    6032     リビングチェスト  
...       ...       ...     ...          ...  
2294        3       その他    8031         カタログ  
2295        3       その他    8032  ＨＯＷ　ＴＯ　シリーズ  
2296        4       人件費    8040        厚生福利費  
2297      980  カインズ　コート    9800     カインズ　コート  
2298      990      売上除外    9988       販売用レジ袋  






tenpo_df = common.extract_as_df(path_tenpo_master, bucket_name)      LPAD(TENPO_CD,4,0)  BR_NO  MAINT_FROM_YMD  MAINT_TO_YMD TENPO_NM_KJ  \
0                     1      0        20181005      99999999     カインズ　本部   
1                     8      0        20250919      99999999    MDカインズWS   
2                    11      0        20250905      99999999   カインズリフォーム   
3                    12      0        20250816      99999999   UNIカインズWS   
4                    13      0        20250822      99999999   IZMカインズWS   
..                  ...    ...             ...           ...         ...   
364                 993      0        20241016      99999999      修理センター   
365                 994      0        20240604      99999999  Amazon FBA   
366                 996      0        20181005      99999999      ベイシア取引   
367                 997      0        20240403      99999999     CzPRO外商   
368                 998      0        20240510      99999999    札幌ホールセール   

      TENPO_NM_K TENPO_RYAKUSHO_KJ TENPO_RYAKUSHO_K  TODOFUKEN_CD  YUBIN_NO  \
0     ｶｲﾝｽﾞ ﾎﾝﾌﾞ                本部             ﾎﾝﾌﾞ            11  367-0030   
1      MDｶｲﾝｽﾞWS          MDカインズWS         MDｶｲﾝｽﾞW            28  000-0000   
2     ｶｲﾝｽﾞﾘﾌｫｰﾑ          カインズリフォー         ｶｲﾝｽﾞﾘﾌｫ            11  000-0000   
3     UNIｶｲﾝｽﾞWS          UNIカインズW         UNIｶｲﾝｽﾞ             9  000-0000   
4     IZMｶｲﾝｽﾞWS          IZMカインズW         IZMｶｲﾝｽW            40  000-0000   
..           ...               ...              ...           ...       ...   
364     ｼｭｳﾘｾﾝﾀｰ            修理センター         ｼｭｳﾘｾﾝﾀｰ            11  355-0215   
365   Amazon FBA          Amazon F         Amazon F             9  329-1579   
366    ﾍﾞｲｼｱﾄﾘﾋｷ            ベイシア取引         ﾍﾞｲｼｱﾄﾘﾋ            11  367-0030   
367  Czproｶﾞｲｼｮｳ           CzPRO外商         Czproｶﾞｲ            10  000-0000   
368  ｻｯﾎﾟﾛﾎｰﾙｾｰﾙ          札幌ホールセール         ｻｯﾎﾟﾛﾎｰﾙ             1  003-0030   

                               JUSHO_KJ  \
0                    埼玉県本庄市早稲田の杜一丁目２番１号   
1    兵庫県神戸市須磨区弥栄台４－１－１（福山通運　神戸流通センター１Ｆ）   
2                                   埼玉県   
3                         栃木県矢板市こぶし台５－１   
4                    福岡県福岡市東区大字蒲田８３７１－１   
..                                  ...   
364                    埼玉県比企郡嵐山町菅谷５２５－１   
365                         栃木県矢板市こぶし台５   
366                  埼玉県本庄市早稲田の杜一丁目２番１号   
367                              群馬県高崎市   
368       北海道札幌市白石区流通センター４丁目５－１日本通運（株）内   

                                             JUSHO_K TEL_NO_DAIHYO  \
0                          ｻｲﾀﾏｹﾝﾎﾝｼﾞｮｳｼﾜｾﾀﾞﾉﾓﾘ1-2-1  0495-25-1000   
1                                            ﾋｮｳｺﾞｹﾝ  000-000-0000   
2                                             ｻｲﾀﾏｹﾝ  0000-00-0000   
3                                             ﾄﾁｷﾞｹﾝ  0000-00-0000   
4                                            ﾋｮｳｺﾞｹﾝ  0000-00-0000   
..                                               ...           ...   
364                      ｻｲﾀﾏｹﾝﾋｷｸﾞﾝﾗﾝｻﾞﾝﾏﾁｽｶﾞﾔ525-1  0493-00-0000   
365                               ﾄﾁｷﾞｹﾝﾔｲﾀｼｺﾌﾞｼﾀﾞｲ5  0287-48-7321   
366                        ｻｲﾀﾏｹﾝﾎﾝｼﾞｮｳｼﾜｾﾀﾞﾉﾓﾘ1-2-1  0495-25-1000   
367                                      ｸﾞﾝﾏｹﾝﾀｶｻｷｼ  0000-00-0000   
368  ﾎｯｶｲﾄﾞｳｻｯﾎﾟﾛｼｼﾛｲｼｸﾘｭｳﾂｳｾﾝﾀｰ4ﾁｮｳﾒ5-1ﾆﾎﾝﾂｳｳﾝｶﾌﾞﾅｲ  0000-00-0000   

    TEL_NO_YAKAN  TEL_NO_TENPO_CHOKUTSU        FAX_NO FAX_NO_YOBI  \
0            NaN                    NaN  0495-25-1001         NaN   
1            NaN                    NaN           NaN         NaN   
2            NaN                    NaN           NaN         NaN   
3            NaN                    NaN           NaN         NaN   
4            NaN                    NaN           NaN         NaN   
..           ...                    ...           ...         ...   
364          NaN                    NaN           NaN         NaN   
365          NaN                    NaN           NaN         NaN   
366          NaN                    NaN  0495-25-1001         NaN   
367          NaN                    NaN           NaN         NaN   
368          NaN                    NaN           NaN         NaN   

     CHOKUEI_FC_KBN  SHOP_KEITAI_KBN  ICHIJI_HEITEN_KBN  SHIZAIKAN_UMU  \
0                 5                0                  0              0   
1                 0                0                  0              0   
2                 0                7                  0              0   
3                 0                0                  0              0   
4                 0                0                  0              0   
..              ...              ...                ...            ...   
364               0                0                  0              0   
365               0                0                  0              0   
366               0                0                  0              0   
367               0                0                  0              0   
368               0                0                  0              0   

     GREEN_UMU  TORIATSUKAI_DC_KBN  POS_KADO_KBN  AREA_KBN  YOREI_CENTER_KBN  \
0            0                   1           NaN        90                 0   
1            0                   3           NaN        90                 0   
2            0                   1           NaN        90                 0   
3            0                   2           NaN        90                 0   
4            0                  11           NaN        90                 0   
..         ...                 ...           ...       ...               ...   
364          0                   1           NaN        90                 0   
365          0                   2           NaN        90                 0   
366          0                   1           NaN        90                 0   
367          0                   1           NaN        90                 0   
368          0                  10           NaN        90                 0   

     RANK_GRP_KBN  ZKS1  ZKS2  ZKS3  ZKS4  ZKS5 HAISO_PTN_KBN  \
0            94.0   NaN   NaN   NaN   NaN     0             C   
1            94.0   NaN   NaN   NaN   NaN     0             C   
2            94.0   NaN   NaN   NaN   NaN     0             C   
3            94.0   NaN   NaN   NaN   NaN     0             C   
4            94.0   NaN   NaN   NaN   NaN     0             C   
..            ...   ...   ...   ...   ...   ...           ...   
364          94.0   NaN   NaN   NaN   NaN     0             C   
365          94.0   NaN   NaN   NaN   NaN     0             C   
366          94.0   NaN   NaN   NaN   NaN     0             C   
367          94.0   NaN   NaN   NaN   NaN     0             C   
368          94.0   NaN   NaN   NaN   NaN     0             C   

     HACCHU_IDO_PRO_FROM_YMD  HACCHU_IDO_PRO_TO_YMD  KAITEN_YMD  HEITEN_YMD  \
0                   99999999               99999999    19960930    99999999   
1                   20250616               20250803    20250616    99999999   
2                   20250616               20250724    20250616    99999999   
3                   20250616               20250803    20250616    99999999   
4                   20250616               20250803    20250616    99999999   
..                       ...                    ...         ...         ...   
364                 99999999               99999999    20240116    99999999   
365                 20240312               20240501    20240316    99999999   
366                 99999999               99999999    20150521    99999999   
367                 20240312               99999999    20200829    99999999   
368                 20240318               20240320    20240316    99999999   

     LAST_ZOSHO_YMD  SHIKICHI_MENSEKI  OKUNAI_URIBA_MENSEKI  \
0               NaN               0.0                   0.0   
1               NaN               NaN                   NaN   
2               NaN               NaN                   NaN   
3               NaN               NaN                   NaN   
4               NaN               NaN                   NaN   
..              ...               ...                   ...   
364             NaN               NaN                   NaN   
365             NaN               NaN                   NaN   
366             NaN               NaN                   NaN   
367             NaN               0.0                   0.0   
368             NaN               0.0                   0.0   

     OKUGAI_URIBA_MENSEKI  CHUSHA_KANO_DAISU GINKO_CD SHITEN_CD  \
0                     0.0                0.0     0000       000   
1                     NaN                NaN      NaN       NaN   
2                     NaN                NaN     0001       310   
3                     NaN                NaN      NaN       NaN   
4                     NaN                NaN      NaN       NaN   
..                    ...                ...      ...       ...   
364                   NaN                NaN      NaN       NaN   
365                   NaN                NaN      NaN       NaN   
366                   NaN                NaN      NaN       NaN   
367                   0.0                0.0     0000       000   
368                   0.0                0.0     0000       000   

     YOKIN_SHUBETSU_MISE_KOZA KOZA_NO_MISE_KOZA DENPYO_KOZA_MISE_KOZA  \
0                         NaN           0000000                000000   
1                         1.0               NaN                   NaN   
2                         1.0           3117223                   NaN   
3                         1.0               NaN                   NaN   
4                         1.0               NaN                   NaN   
..                        ...               ...                   ...   
364                       1.0               NaN                   NaN   
365                       1.0               NaN                   NaN   
366                       1.0               NaN                   NaN   
367                       NaN           0000000                000000   
368                       NaN           0000000                000000   

    KOZA_MEIGI_MISE_KOZA  YOKIN_SHUBETSU_URI_KOZA KOZA_NO_URI_KOZA  \
0                      0                      NaN          0000000   
1                    NaN                      1.0              NaN   
2                    NaN                      1.0              NaN   
3                    NaN                      1.0              NaN   
4                    NaN                      1.0              NaN   
..                   ...                      ...              ...   
364                  NaN                      1.0              NaN   
365                  NaN                      1.0              NaN   
366                  NaN                      1.0              NaN   
367                    0                      NaN          0000000   
368                    0                      NaN          0000000   

    DENPYO_KOZA_URI_KOZA KOZA_MEIGI_URI_KOZA  SUIAGE_GINKO_KBN  \
0                 000000                   0               NaN   
1                    NaN                 NaN               NaN   
2                    NaN                 NaN               NaN   
3                    NaN                 NaN               NaN   
4                    NaN                 NaN               NaN   
..                   ...                 ...               ...   
364                  NaN                 NaN               NaN   
365                  NaN                 NaN               NaN   
366                  NaN                 NaN               NaN   
367               000000                   0               NaN   
368               000000                   0               NaN   

     KAISO_FROM_YMD  KAISO_TO_YMD  MASTER_INITIAL_YMD  SA_SETUP_YMD  \
0               NaN           NaN          19980318.0           NaN   
1               NaN           NaN                 NaN           NaN   
2               NaN           NaN          20250724.0           NaN   
3               NaN           NaN                 NaN           NaN   
4               NaN           NaN                 NaN           NaN   
..              ...           ...                 ...           ...   
364             NaN           NaN                 NaN           NaN   
365             NaN           NaN                 NaN           NaN   
366             NaN           NaN          20990101.0           NaN   
367             NaN           NaN                 NaN           NaN   
368             NaN           NaN                 NaN           NaN   

     HACCHU_HONBAN_YMD  URIAGE_HONBAN_YMD  KEIJO_HONBAN_YMD  \
0           19961106.0         19980324.0        19980324.0   
1                  NaN                NaN               NaN   
2           20250724.0         20250724.0        20250724.0   
3                  NaN                NaN               NaN   
4                  NaN                NaN               NaN   
..                 ...                ...               ...   
364                NaN                NaN               NaN   
365         20240501.0         20240501.0        20240501.0   
366         20150527.0         20150527.0        20150527.0   
367                NaN                NaN               NaN   
368         20240321.0         20240321.0        20240321.0   

     KINTAI_HONBAN_YMD  YOSAN_HONBAN_YMD  PC_OUTPUT_YMD  \
0           19961018.0        19961120.0     19980319.0   
1                  NaN               NaN            NaN   
2           20250724.0        20250724.0     20250724.0   
3                  NaN               NaN            NaN   
4                  NaN               NaN            NaN   
..                 ...               ...            ...   
364                NaN               NaN            NaN   
365                NaN               NaN            NaN   
366         20150527.0        20150527.0     20150527.0   
367                NaN               NaN            NaN   
368         20240321.0        20240321.0            NaN   

     WK1_DATAHOST_HAISHIN_YMD  HACCHUTEN_MASTER_YMD  \
0                         NaN                   NaN   
1                         NaN                   NaN   
2                         NaN                   NaN   
3                         NaN                   NaN   
4                         NaN                   NaN   
..                        ...                   ...   
364                       NaN                   NaN   
365                       NaN                   NaN   
366                       NaN                   NaN   
367                       NaN                   NaN   
368                       NaN                   NaN   

     SNTN_HACCHU_RNRK_FROM_YMD  GAICHU_SEIGEN_KBN  TEN_KIBO  RICCHI_JOKEN_KBN  \
0                          NaN                NaN      94.0               1.0   
1                          NaN                NaN      94.0              90.0   
2                   20250724.0                NaN      94.0              90.0   
3                          NaN                NaN      94.0              90.0   
4                          NaN                NaN      94.0              90.0   
..                         ...                ...       ...               ...   
364                        NaN                NaN      94.0              90.0   
365                        NaN                NaN      94.0              90.0   
366                        NaN                NaN      94.0               1.0   
367                        NaN                NaN      94.0               1.0   
368                        NaN                NaN      94.0              90.0   

     URIBA_TSUBO_SU  KANZAN  GONDORA  HIRADAI_DAISU  GREEN_ICHIBA_CD  \
0               NaN     NaN      NaN            NaN              NaN   
1               NaN     NaN      NaN            NaN              NaN   
2               NaN     NaN      NaN            NaN              NaN   
3               NaN     NaN      NaN            NaN              NaN   
4               NaN     NaN      NaN            NaN              NaN   
..              ...     ...      ...            ...              ...   
364             NaN     NaN      NaN            NaN              NaN   
365             NaN     NaN      NaN            NaN              NaN   
366             NaN     NaN      NaN            NaN              NaN   
367             NaN     NaN      NaN            NaN              NaN   
368             NaN     NaN      NaN            NaN              NaN   

     PMM_TOROKU_SHORI_KBN  AREA_HENKO_FLG  PMM_IDO_PARAM_TOROKU_ZM_FLG  \
0                       2               0                            0   
1                       2               0                            1   
2                       2               0                            1   
3                       2               0                            1   
4                       2               0                            1   
..                    ...             ...                          ...   
364                     2               0                            1   
365                     2               0                            1   
366                     2               0                            1   
367                     2               0                            1   
368                     2               0                            1   

                      REG_DT UPD_USER_ID               BAT_UPD_DT  \
0    2018-10-04 10:43:08.000    05046503  2018-10-05 03:12:11.000   
1    2025-09-18 12:24:04.000    05046503  2025-09-19 02:59:10.000   
2    2025-09-04 10:25:33.000    02227007  2025-09-05 03:28:53.000   
3    2025-08-15 12:00:04.000    02227007  2025-08-16 03:38:56.000   
4    2025-08-21 11:51:53.000    02227007  2025-09-22 02:58:52.000   
..                       ...         ...                      ...   
364  2024-10-08 15:20:07.000    02227007  2024-10-16 02:58:27.000   
365  2024-06-03 16:30:45.000    02227007  2024-06-04 02:20:08.000   
366  2018-10-04 10:51:43.000    05046503  2018-10-05 03:12:11.000   
367  2024-04-02 18:21:38.000    02227007  2024-04-03 02:42:37.000   
368  2024-05-09 15:13:39.000    02227007  2024-05-10 03:01:51.000   

                  SCR_UPD_DT          BAT_ID          SCR_ID  UPD_MNG_NO  
0    2018-10-04 10:43:08.000  MK020K0251_P01  MK020K0202_V01           1  
1    2025-09-18 12:24:04.000  MK020K0251_P01  MK020K0202_V01           1  
2    2025-09-04 10:25:33.000  MK020K0251_P01  MK020K0202_V01           1  
3    2025-08-15 12:00:04.000  MK020K0284_P01  MK020K0202_V01           2  
4    2025-08-21 11:51:53.000  MK030P1828_P01  MK020K0202_V01           2  
..                       ...             ...             ...         ...  
364  2024-10-08 15:20:07.000  MK020K0284_P01  MK020K0202_V01           2  
365  2024-06-03 16:30:45.000  MK020K0251_P01  MK020K0202_V01           3  
366  2018-10-04 10:51:43.000  MK020K0251_P01  MK020K0202_V01           1  
367  2024-04-02 18:21:38.000  MK020K0284_P01  MK020K0202_V01           2  
368  2024-05-09 15:13:39.000  MK020K0251_P01  MK020K0202_V01           1  







selling_period_all = common.extract_as_df(path_selling_period, bucket_name)           tenpo_cd         prd_cd          prd_no  tanagae_hokoku_day  \
0              737  4961691105374  20999983240001            20200929   
1              154  4549509314523  16126010000005            20171025   
2              806  4901609011359  19999987320016            20190422   
3              807  4987072038505  15999987320016            20151218   
4              790  4956810861606  16999975900006            20160901   
...            ...            ...             ...                 ...   
42224565       752  4549509839019  21006310002022            20220522   
42224566       282  4905284146412   9000010146803            20140118   
42224567       736  4902430709668  16999987140111            20170220   
42224568       250  4549509395331  17025292800004            20180423   
42224569       233  4901210169746  14999917500006            20140704   

          hacchu_to_ymd  
0              99999999  
1              99999999  
2              99999999  
3              99999999  
4              99999999  
...                 ...  
42224565       20220330  
42224566       20130219  
42224567       20171014  
42224568       20190620  
42224569       20141111  










prd_asc = common.extract_as_df(path_prd_asc, bucket_name)               prd_cd  dpt                  prd_nm_kj  baika_toitsu  \
0           47478640   77   ＜長野＞Ｃよなよなエール　ビール　３５０缶×２４          6580   
1        41570112366   64       Ｃアーモンドブリーズオリジナル１Ｌ×６本          1750   
2        41570112380   64       Ｃアーモンドブリーズ砂糖不使用１Ｌ×６本          1750   
3        71990095116   77             ブルームーン　３５５ｍｌ×６          1968   
4        71990095123   77           Ｃブルームーン　３５５ｍｌ×２４          7850   
...              ...  ...                        ...           ...   
30561  8801048167814   77       ▼Ｃ韓国焼酎　２０°眞露　４Ｌペット×４          9500   
30562  8801119684417   77  ＪＩＮＲＯｈｉｔｅｄ（ハイトディ）３５０Ｘ６缶パッ           870   
30563  8801119684424   77  ＣＪＩＮＲＯ　Ｈｉｔｅ（ハイトディ）３５０Ｘ６缶パ          3480   
30564  8801119684424   77  ＣＪＩＮＲＯ　Ｈｉｔｅ（ハイトディ）３５０Ｘ６缶パ          3480   
30565  8801147110537   77    Ｃアサヒ　韓国焼酎　韓楽　２０°２．７Ｌケース          7680   

       hacchu_tani_toitsu_kosu  daihyo_torihikisaki_cd daihyo_torihikisaki_nm  \
0                            1                  926221    日本酒類販売（株）流通第三本部営業二部   
1                            1                  762148        マルサンアイ（株）　関信越支店   
2                            1                  762148        マルサンアイ（株）　関信越支店   
3                            4                  987956              ＰＯＳ　ＰＬＵ登録   
4                            1                  926221    日本酒類販売（株）流通第三本部営業二部   
...                        ...                     ...                    ...   
30561                        1                  987956              ＰＯＳ　ＰＬＵ登録   
30562                        1                  987956              ＰＯＳ　ＰＬＵ登録   
30563                        1                  926221    日本酒類販売（株）流通第三本部営業二部   
30564                        1                  926221    日本酒類販売（株）流通第三本部営業二部   
30565                        1                  987956              ＰＯＳ　ＰＬＵ登録   

       asc_riyu_cd  iri_su     asc_prd_cd  asc_dpt              asc_prd_nm_kj  \
0                3      24       47478619       77              よなよなエール　３５０ｍｌ   
1                3       6    41570112359       64           アーモンドブリーズオリジナル１Ｌ   
2                3       6    41570112373       64           アーモンドブリーズ砂糖不使用１Ｌ   
3                3       6  4902335060017       77               ブルームーン　３５５ｍｌ   
4                3       4    71990095116       77             ブルームーン　３５５ｍｌ×６   
...            ...     ...            ...      ...                        ...   
30561            3       4  8801048167210       77        ▼韓国焼酎　眞露（ジンロ）２０°　４Ｌ   
30562            3       6  8801119684400       77  ＪＩＮＲＯｈｉｔｅｄ（ハイトディ）３５０Ｘ６缶バラ   
30563            3      24  8801119684400       77  ＪＩＮＲＯｈｉｔｅｄ（ハイトディ）３５０Ｘ６缶バラ   
30564            3       4  8801119684417       77  ＪＩＮＲＯｈｉｔｅｄ（ハイトディ）３５０Ｘ６缶パッ   
30565            3       6  8801147100507       77  Ｑアサヒ　国焼酎　韓楽（ハンラク）２０°　２．７Ｌ   

       asc_baika_toitsu  asc_hacchu_tani_toitsu_kosu  \
0                   278                           24   
1                   298                            6   
2                   298                            6   
3                   328                           24   
4                  1968                            4   
...                 ...                          ...   
30561              2480                            4   
30562               145                            1   
30563               145                            1   
30564               870                            1   
30565              1280                            6   

       asc_daihyo_torihikisaki_cd asc_daihyo_torihikisaki_nm  
0                          987956                  ＰＯＳ　ＰＬＵ登録  
1                          987956                  ＰＯＳ　ＰＬＵ登録  
2                          987956                  ＰＯＳ　ＰＬＵ登録  
3                          987956                  ＰＯＳ　ＰＬＵ登録  
4                          987956                  ＰＯＳ　ＰＬＵ登録  
...                           ...                        ...  
30561                      926221        日本酒類販売（株）流通第三本部営業二部  
30562                      987956                  ＰＯＳ　ＰＬＵ登録  
30563                      987956                  ＰＯＳ　ＰＬＵ登録  
30564                      987956                  ＰＯＳ　ＰＬＵ登録  
30565                      770663       伊藤忠食品（株）東日本営業本部営業第三部 
















chance_loss_data         BUMON_CD  TENPO_CD          PRD_NO  NENSHUDO         PRD_CD  \
0            002       760  09000010000227    202352       45113697   
1            011       760  58750900000659    202430  4549917217485   
2            023       760  15999923000005    202130  4548792000731   
3            023       760  15999923460002    202053  4902993101947   
4            032       760  09000010163145    202013  4909246303318   
...          ...       ...             ...       ...            ...   
1329167      094       760  19999994520005    202438  4975302540218   
1329168      094       760  20999994100001    202008  4573110734128   
1329169      094       760  51115700000050    202333  4944370042351   
1329170      094       760  59470830000292    202440  4983771114601   
1329171      094       760  59491670000190    202305  4981747074133   

         KEPPIN_CNT  CHANCE_LOSS_PRD_SU  CHANCE_LOSS_KN  
0                 7                 0.0             0.0  
1                 7                 0.0             0.0  
2                 3                 0.0             0.0  
3                 6                 0.0             0.0  
4                 3                 1.0           784.0  
...             ...                 ...             ...  
1329167           3                 0.0             0.0  
1329168           3                 0.0             0.0  
1329169           7                 0.0             0.0  
1329170           4                 1.0          4882.0  
1329171           7                 0.0             0.0  

[1329172 rows x 8 columns]
jan_master             店着日  old_DPT        old_JAN  how_change  new_DPT        new_JAN  \
0      20170105       18  4560464244311           7       18  4976790775304   
1      20170105       18  4976790761499           7       18  4549509238133   
2      20170105       18  4971404308190           8       18  4971404313064   
3      20170105       91  4936695453479           8       91  4549509167846   
4      20170105       91  4936695453516           8       91  4549509167839   
...         ...      ...            ...         ...      ...            ...   
43597  20250925       91  4973007525912           2       91  4974267132377   
43598  20250925       91  4973007006688           2       91  4973007006664   
43599  20250925       91  4571175633455           3       91  4571175633745   
43600  20250925       91  4979969804973           2       91  4545708004180   
43601  20250925       94  4936695985604           8       94  4972353135066   

        店番  
0      760  
1      760  
2      760  
3      760  
4      760  
...    ...  
43597  760  
43598  760  
43599  760  
43600  760  
43601  760  

[43602 rows x 7 columns]
store_prd_hacchu_ymd                  PRD_CD  TENPO_CD  HACCHU_YMD_SEQ_NO  HACCHU_FROM_YMD  \
0         4936695722605       758                5.0       20140831.0   
1         4936695722605       759                5.0       20140831.0   
2         4936695722605       760                5.0       20140831.0   
3         4936695722605       763                5.0       20140831.0   
4         4936695722605       764                5.0       20140831.0   
...                 ...       ...                ...              ...   
73230827  4901099033176       772                1.0       20190709.0   
73230828  4901099033176       774                5.0       20190731.0   
73230829  4901099033176       775                1.0       20190709.0   
73230830  4901099033176       777                5.0       20190731.0   
73230831  4901099033176       779                5.0       20190731.0   

          HACCHU_TO_YMD  
0              20140831  
1              20140831  
2              20140831  
3              20140831  
4              20140831  
...                 ...  
73230827       99999999  
73230828       20190731  
73230829       99999999  
73230830       20190731  
73230831       20190731  

[73230832 rows x 5 columns]
dfm_base          hojin_cd          prd_no  prd_no_br_no  honbu_cd  jigyobu_cd  \
0              24  59292470000074             0         2           3   
1              24  59292470000172             0         2           3   
2              24  16999902000014             0         2           3   
3              24  18999902000012             0         2           3   
4              24   9000010117230             0         2           3   
...           ...             ...           ...       ...         ...   
1039027        24  53121850000982             0         1           6   
1039028        24  57482420000284             0         1           6   
1039029        24   9000010365524             0         1           6   
1039030        24  17999997510030             0         1           6   
1039031        24  14999936000002             0         9          98   

         bumon_cd  line_cd  cls_cd  nendo  prd_pln_no      hnmk_cd  \
0               2       20     200   2022         NaN  99292470200   
1               2       20     200   2024         NaN  99292470200   
2               2       20     200   2016         NaN  99999990200   
3               2       20     200   2018         NaN  99999990200   
4               2       20     200   2009         NaN  99020000089   
...           ...      ...     ...    ...         ...          ...   
1039027        97      975    9751   2024         NaN  93121859751   
1039028        97      975    9751   2023         NaN  23000010284   
1039029        97      975    9751   2009         NaN  99999999751   
1039030        97      975    9753   2017         NaN  99470839753   
1039031        98      980    9800   2014   1000061.0  10000610200   

         maint_from_ymd  maint_to_ymd         prd_cd  eos_cd  sku_kbn_cd  \
0              20240511      99999999       45213878     0.0           1   
1              20240814      99999999       45219467     0.0           1   
2              20201001      99999999       49401349     0.0           1   
3              20240917      99999999  4902210130019     0.0           1   
4              20240808      99999999  4902210142616     0.0           1   
...                 ...           ...            ...     ...         ...   
1039027        20250808      99999999  4963027421240     0.0           1   
1039028        20250919      99999999  4983936414676     0.0           1   
1039029        20150514      99999999  4984824793927     0.0           1   
1039030        20220713      99999999  4580088470125     0.0           1   
1039031        20191001      99999999  4549509043706     0.0           1   

                          prd_nm_k                   prd_nm_kj  \
0           ﾒﾋﾞｳｽ･ｲｰｼﾘｰｽﾞ･3･100･1P        メビウス・イーシリーズ・３・１００・１Ｐ   
1                         ｴｺｰKS_1P                    エコーＫＳ＿１Ｐ   
2         ｳｨﾝｽﾄﾝﾐﾆﾋﾞﾀｰｽｲｰﾄﾎﾜｲﾄﾜﾝ1P     ウィンストンミニビタースイートホワイトワン１Ｐ   
3        ﾒﾋﾞｳｽﾐｯｸｽGｸｰﾗｰﾌｫｰﾌﾟﾙｰﾑﾃｯｸ  ＱＣメビウスミックスグリーンクーラーフォープルームテ   
4              Qﾒﾋﾞｳｽ･ｺﾞｰﾙﾄﾞ･6 10P           ＱＣメビウス・ゴールド・６　１０個   
...                            ...                         ...   
1039027  ｱﾋﾟｯｸｽ ﾁｮｳｵﾝﾊﾟｼｷｶｼﾂｷ AHD-   アピックス　超音波式加湿器　ＡＨＤ－１２４（ＧＲ）   
1039028            ｴﾚｽ ｱﾛﾐｽﾄﾌﾚｰﾑBK             エレス　アロミストフレームＢＫ   
1039029     ﾅｼｮﾅﾙ ｶｼﾂｷ FE-03TLB-AH   ナショナルハイブリッド加湿器ＦＥ－０３ＴＬＢ－ＡＨ   
1039030     ｳｨﾙｽﾀｲｻｸｵﾁｬﾉﾁｶﾗ PKMM02         ウィルス対策お茶のちから　ＰＫＭＭ０２   
1039031                          -                        ×テスト   

                    prd_nm_k_czpos            prd_nm_kj_czpos  \
0           ﾒﾋﾞｳｽ･ｲｰｼﾘｰｽﾞ･3･100･1P       メビウス・イーシリーズ・３・１００・１Ｐ   
1                         ｴｺｰKS_1P                   エコーＫＳ＿１Ｐ   
2         ｳｨﾝｽﾄﾝﾐﾆﾋﾞﾀｰｽｲｰﾄﾎﾜｲﾄﾜﾝ1P    ウィンストンミニビタースイートホワイトワン１Ｐ   
3        ﾒﾋﾞｳｽﾐｯｸｽGｸｰﾗｰﾌｫｰﾌﾟﾙｰﾑﾃｯｸ  ＱＣメビウスミックスグリーンクーラーフォープルーム   
4              Qﾒﾋﾞｳｽ･ｺﾞｰﾙﾄﾞ･6 10P          ＱＣメビウス・ゴールド・６　１０個   
...                            ...                        ...   
1039027  ｱﾋﾟｯｸｽ ﾁｮｳｵﾝﾊﾟｼｷｶｼﾂｷ AHD-  アピックス　超音波式加湿器　ＡＨＤ－１２４（ＧＲ）   
1039028            ｴﾚｽ ｱﾛﾐｽﾄﾌﾚｰﾑBK            エレス　アロミストフレームＢＫ   
1039029     ﾅｼｮﾅﾙ ｶｼﾂｷ FE-03TLB-AH  ナショナルハイブリッド加湿器ＦＥ－０３ＴＬＢ－ＡＨ   
1039030     ｳｨﾙｽﾀｲｻｸｵﾁｬﾉﾁｶﾗ PKMM02        ウィルス対策お茶のちから　ＰＫＭＭ０２   
1039031                          -                       ×テスト   

                     prd_nm_kj_full prd_nm_receipt  kataban  hanbai_koku_cd  \
0              メビウス・イーシリーズ・３・１００・１Ｐ   MVE･3･100・1P      NaN             1.0   
1                          エコーＫＳ＿１Ｐ       エコーKS_１P      NaN             1.0   
2           ウィンストンミニビタースイートホワイトワン１Ｐ   ｳｨﾝｽﾄﾝﾎﾜｲﾄ1P      NaN             1.0   
3        ＱＣメビウスミックスグリーンクーラーフォープルームテ           ミックス      NaN             1.0   
4                 ＱＣメビウス・ゴールド・６　１０個   ﾒﾋﾞｳｽ･ｺﾞｰﾙﾄﾞ      NaN             1.0   
...                             ...            ...      ...             ...   
1039027   アピックス　超音波式加湿器　ＡＨＤ－１２４（ＧＲ）            加湿器      NaN             1.0   
1039028             エレス　アロミストフレームＢＫ            加湿器  AMF23BK             1.0   
1039029   ナショナルハイブリッド加湿器ＦＥ－０３ＴＬＢ－ＡＨ   ｶｼﾂｷFE-03TLB      NaN             1.0   
1039030         ウィルス対策お茶のちから　ＰＫＭＭ０２        ｵﾁｬﾉﾁｶﾗ   PKMM02             1.0   
1039031                        ×テスト              ×      NaN             1.0   

         daihyo_torihikisaki_cd maker_no  maker_depot_kbn  nohin_keitai_kbn  \
0                      929247.0       45                0                 0   
1                      929247.0       45                0                 0   
2                      929247.0       49                0                 1   
3                      929247.0     2210                0                 1   
4                      929247.0     2210                0                 1   
...                         ...      ...              ...               ...   
1039027                312185.0    63027                0                 1   
1039028                748242.0    83936                0                 0   
1039029                924229.0    84824                0                 1   
1039030                947083.0    80088                0                 1   
1039031                987956.0     6456                0                 1   

         hacchu_tani_toitsu_kosu  tenpo_hacchu_sum_kbn  prd_sku_shubetsu_cd  \
0                           10.0                     0                  1.0   
1                           10.0                     0                  1.0   
2                           10.0                     0                  1.0   
3                            1.0                     0                  1.0   
4                            1.0                     0                  1.0   
...                          ...                   ...                  ...   
1039027                      1.0                     0                  1.0   
1039028                      2.0                     1                  1.0   
1039029                      1.0                     0                  1.0   
1039030                      1.0                     1                  1.0   
1039031                      1.0                     0                  1.0   

         case_prd_cfg_flg  assort_prd_cfg_flg  shoki_genka  shoki_baika  \
0                       0                   0       404.00          500   
1                       0                   0       404.54          500   
2                       0                   0       313.85          380   
3                       0                   0      2279.56         2760   
4                       0                   0      3494.76         4100   
...                   ...                 ...          ...          ...   
1039027                 0                   0      4171.00         7980   
1039028                 0                   0      2150.00         3980   
1039029                 0                   0      7200.00         9980   
1039030                 0                   0       635.00          980   
1039031                 0                   0       100.00          150   

         genka_toitsu  baika_toitsu  season_cd  color_nm_cd  size_cd  \
0              404.00           500        1.0          NaN      NaN   
1              404.54           500        1.0          NaN      NaN   
2              364.09           450        1.0          NaN      NaN   
3             2816.00          3480        1.0          NaN      NaN   
4             4693.00          5800        1.0          NaN      NaN   
...               ...           ...        ...          ...      ...   
1039027       4171.00          7980       80.0          NaN      NaN   
1039028       2150.00          3980       80.0          NaN      NaN   
1039029       7200.00          9980        1.0          NaN      NaN   
1039030        635.00           280        1.0          7.0      NaN   
1039031        100.00           150        1.0          NaN      NaN   

         low_price_kbn  ssk_kbn  kkng_seihin_kbn  seisan_koku_cd  pbsb_nm_kbn  \
0                    0        0                0               1            0   
1                    0        0                0               1            0   
2                    0        0                0               1            0   
3                    0        0                0               1            0   
4                    0        0                0               1            0   
...                ...      ...              ...             ...          ...   
1039027              0        0                0             101            0   
1039028              0        0                0             101            0   
1039029              0        0                0               1            0   
1039030              0        0                0               1            0   
1039031              0        0                0             101            0   

         frm_kbn  chilled_kbn  label_shu_kbn  label_hakko_maisu_kbn  \
0              0            0              0                      0   
1              0            0              0                      0   
2              0            0              0                      0   
3              0            0              0                      0   
4              0            0              0                      0   
...          ...          ...            ...                    ...   
1039027        0            0              0                      0   
1039028        0            0              0                      0   
1039029        0            0              0                      0   
1039030        0            0              0                      0   
1039031        0            0              0                      0   

         royalties_kbn  keikaku_su  hanbai_from_ymd  hanbai_to_ymd  \
0                  0.0           0              NaN            NaN   
1                  0.0           0              NaN            NaN   
2                  0.0           0              NaN            NaN   
3                  0.0           0              NaN            NaN   
4                  0.0           0              NaN            NaN   
...                ...         ...              ...            ...   
1039027            0.0           0              NaN     20250616.0   
1039028            0.0           0              NaN            NaN   
1039029            0.0           0              NaN            NaN   
1039030            0.0           0              NaN            NaN   
1039031            0.0           0              NaN            NaN   

         hanbai_end_flg  tenpo_hacchu_from_ymd_toitsu  \
0                     0                    20221007.0   
1                     0                    20240814.0   
2                     0                    20170212.0   
3                     0                    20180829.0   
4                     0                    20071201.0   
...                 ...                           ...   
1039027               1                    20240802.0   
1039028               0                    20230715.0   
1039029               0                    20070809.0   
1039030               0                    20170726.0   
1039031               0                           NaN   

         tenpo_hacchu_to_ymd_toitsu  tenpo_hacchu_end_riyu_cd  \
0                        20240510.0                       NaN   
1                        99999999.0                       NaN   
2                        20170212.0                       NaN   
3                        20240916.0                       NaN   
4                        20240812.0                       NaN   
...                             ...                       ...   
1039027                  20250807.0                       NaN   
1039028                  20251231.0                       NaN   
1039029                  20071217.0                       NaN   
1039030                  20190310.0                       NaN   
1039031                         NaN                       NaN   

         tenpo_hacchu_end_flg  honbu_hacchu_from_ymd  honbu_hacchu_to_ymd  \
0                           1                    NaN                  NaN   
1                           0                    NaN                  NaN   
2                           1                    NaN                  NaN   
3                           1                    NaN                  NaN   
4                           1                    NaN                  NaN   
...                       ...                    ...                  ...   
1039027                     1                    NaN                  NaN   
1039028                     0                    NaN                  NaN   
1039029                     1                    NaN                  NaN   
1039030                     1                    NaN                  NaN   
1039031                     0                    NaN                  NaN   

         honbu_hacchu_end_flg  zaiko_iji_from_ymd  zaiko_iji_to_ymd  \
0                           0                 NaN               NaN   
1                           0                 NaN               NaN   
2                           0                 NaN               NaN   
3                           0                 NaN               NaN   
4                           0                 NaN               NaN   
...                       ...                 ...               ...   
1039027                     0                 NaN               NaN   
1039028                     0                 NaN               NaN   
1039029                     0                 NaN               NaN   
1039030                     0                 NaN               NaN   
1039031                     0                 NaN               NaN   

         zaiko_iji_end_flg  shibai_from_ymd  shibai_to_ymd  choaisaki_ptn_cd  \
0                        0              NaN            NaN                 0   
1                        0              NaN            NaN                 0   
2                        0              NaN            NaN                 0   
3                        0              NaN            NaN                 0   
4                        0              NaN            NaN                 0   
...                    ...              ...            ...               ...   
1039027                  0              NaN            NaN                 0   
1039028                  0              NaN            NaN                 0   
1039029                  0              NaN            NaN                 0   
1039030                  0              NaN            NaN                 0   
1039031                  0              NaN            NaN                 0   

         prd_kbn_cd  juten_kbn  kiriuri_chk_kbn  zaiko_kanri_kbn  \
0                 1          0                0                1   
1                 1          0                0                1   
2                 1          0                0                1   
3                 1          0                0                1   
4                 1          0                0                1   
...             ...        ...              ...              ...   
1039027           1          0                0                1   
1039028           2          0                0                1   
1039029           1          7                0                1   
1039030           2          0                0                1   
1039031           1          0                0                1   

         shiire_joken_kbn  brand_kbn zaiko_kasho_kbn  tc4_dc4_kbn  \
0                       1          1               0            0   
1                       1          1               0            0   
2                       1          1               0            0   
3                       1          1               0            0   
4                       1          1               0            0   
...                   ...        ...             ...          ...   
1039027                 1          1               0            0   
1039028                 1          1               0            0   
1039029                 1          1               0            0   
1039030                 1          1               0            0   
1039031                 1          1               0            0   

         picking_list_hakko_kbn  tks_center_kbn  hoshosho_umu_kbn  \
0                             0               0               0.0   
1                             0               0               0.0   
2                             0               0               0.0   
3                             0               0               0.0   
4                             0               0               0.0   
...                         ...             ...               ...   
1039027                       0               0               1.0   
1039028                       0               0               1.0   
1039029                       0               0               1.0   
1039030                       0               0               0.0   
1039031                       0               0               0.0   

         fukusu_konpo_kbn  konpo_su  vmi_toroku_flg  naiyoryo  \
0                     0.0         1               0       0.0   
1                     0.0         1               0       0.0   
2                     0.0         1               0       0.0   
3                     0.0         1               0       0.0   
4                     0.0         1               0       0.0   
...                   ...       ...             ...       ...   
1039027               0.0         1               0       0.0   
1039028               0.0         1               0       0.0   
1039029               0.0         1               0       0.0   
1039030               0.0         1               0       0.0   
1039031               0.0         1               0       0.0   

         naiyoryo_tani_cd  shomi_juryo  shomi_juryo_tani_cd  saisu_h  saisu_w  \
0                       0          0.0                    3        0        0   
1                       0          0.0                    3        0        0   
2                       0          0.0                    3        0        0   
3                       0          0.0                    3        0        0   
4                       0          0.0                    3        0        0   
...                   ...          ...                  ...      ...      ...   
1039027                 0          0.0                    3        0        0   
1039028                 0          0.0                    3        0        0   
1039029                 0          0.0                    3        0        0   
1039030                 0          0.0                    3        0        0   
1039031                 0          0.0                    3        0        0   

         saisu_d  itf_cd  gtin_cd prd_nm_en prd_nm_en_czpos butsuryu_ptn_cd  \
0              0       0      NaN       NaN             NaN             NaN   
1              0       0      NaN       NaN             NaN             NaN   
2              0       0      NaN       NaN             NaN             NaN   
3              0       0      NaN       NaN             NaN             NaN   
4              0       0      NaN       NaN             NaN             NaN   
...          ...     ...      ...       ...             ...             ...   
1039027        0       0      NaN       NaN             NaN             NaN   
1039028        0       0      NaN       NaN             NaN             NaN   
1039029        0       0      NaN       NaN             NaN             NaN   
1039030        0       0      NaN       NaN             NaN             NaN   
1039031        0       0      NaN       NaN             NaN             NaN   

         maker_cd_kaigai  kojo_cd  tsuka_cd  kawase_rt  kakaku_cd  \
0                    0.0      0.0       NaN        0.0        NaN   
1                    0.0      0.0       NaN        0.0        NaN   
2                    0.0      0.0       NaN        0.0        NaN   
3                    0.0      0.0       NaN        0.0        NaN   
4                    0.0      0.0       NaN        0.0        NaN   
...                  ...      ...       ...        ...        ...   
1039027              0.0      0.0       NaN        0.0        NaN   
1039028              0.0      0.0       NaN        0.0        NaN   
1039029              0.0      0.0       NaN        0.0        NaN   
1039030              0.0      0.0       NaN        0.0        NaN   
1039031              0.0      0.0       NaN        0.0        NaN   

         tsuka_genka  piece_case_kbn  soto_iri_su_piece  naka_iri_su_piece  \
0                0.0             NaN                  0                  0   
1                0.0             NaN                  0                  0   
2                0.0             NaN                  0                  0   
3                0.0             NaN                  0                  0   
4                0.0             NaN                  0                  0   
...              ...             ...                ...                ...   
1039027          0.0             NaN                  0                  0   
1039028          0.0             NaN                  0                  0   
1039029          0.0             NaN                  0                  0   
1039030          0.0             NaN                  0                  0   
1039031          0.0             NaN                  0                  0   

         gaiso_kosu_tani_cd  seisan_lot  shukka_lot  bunkatsu_kaisu  \
0                       NaN           0           0               0   
1                       NaN           0           0               0   
2                       NaN           0           0               0   
3                       NaN           0           0               0   
4                       NaN           0           0               0   
...                     ...         ...         ...             ...   
1039027                 NaN           0           0               0   
1039028                 NaN           0           0               0   
1039029                 NaN           0           0               0   
1039030                 NaN           0           0               0   
1039031                 NaN           0           0               0   

         soko_hokan_kikan_nissu  soto_w_w_cm  soto_d_d_cm  soto_h_h_cm   m3  \
0                             0          0.0          0.0          0.0  0.0   
1                             0          0.0          0.0          0.0  0.0   
2                             0          0.0          0.0          0.0  0.0   
3                             0          0.0          0.0          0.0  0.0   
4                             0          0.0          0.0          0.0  0.0   
...                         ...          ...          ...          ...  ...   
1039027                       0          0.0          0.0          0.0  0.0   
1039028                       0          0.0          0.0          0.0  0.0   
1039029                       0          0.0          0.0          0.0  0.0   
1039030                       0          0.0          0.0          0.0  0.0   
1039031                       0          0.0          0.0          0.0  0.0   

         soto_juryo  soto_juryo_tani_cd  naka_w_w  naka_d_d  naka_h_h  \
0               0.0                   1       0.0       0.0       0.0   
1               0.0                   1       0.0       0.0       0.0   
2               0.0                   1       0.0       0.0       0.0   
3               0.0                   1       0.0       0.0       0.0   
4               0.0                   1       0.0       0.0       0.0   
...             ...                 ...       ...       ...       ...   
1039027         0.0                   1       0.0       0.0       0.0   
1039028         0.0                   1       0.0       0.0       0.0   
1039029         0.0                   1       0.0       0.0       0.0   
1039030         0.0                   1       0.0       0.0       0.0   
1039031         0.0                   1       0.0       0.0       0.0   

         kowake_w_w  kowake_d_d  kowake_h_h  shiwake_kbn_cd  seisan_lead_time  \
0               0.0         0.0         0.0               0                 0   
1               0.0         0.0         0.0               0                 0   
2               0.0         0.0         0.0               0                 0   
3               0.0         0.0         0.0               0                 0   
4               0.0         0.0         0.0               0                 0   
...             ...         ...         ...             ...               ...   
1039027         0.0         0.0         0.0               0                 0   
1039028         0.0         0.0         0.0               0                 0   
1039029         NaN         NaN         NaN               0                 0   
1039030         0.0         0.0         0.0               0                 0   
1039031         NaN         NaN         NaN               0                 0   

         shidashichi_cd  zks1  suryo_tani_cd  seisan_hacchu_tekiyo_from_ymd  \
0                   NaN   0.0            NaN                     20221007.0   
1                   NaN   0.0            NaN                     20240810.0   
2                   NaN   0.0            NaN                     20170212.0   
3                   NaN   0.0            NaN                     20180828.0   
4                   NaN   0.0            NaN                     20000101.0   
...                 ...   ...            ...                            ...   
1039027             NaN   0.0            NaN                     20240726.0   
1039028             NaN   0.0            NaN                     20230711.0   
1039029             NaN   0.0            NaN                     20000101.0   
1039030             NaN   0.0            NaN                     20170726.0   
1039031             NaN   0.0            NaN                     20000101.0   

         seisan_hacchu_tekiyo_to_ymd  zeiban_zeiban  zeiban_tokei_saibun  \
0                         99999999.0            0.0                  0.0   
1                         99999999.0            0.0                  0.0   
2                         99999999.0            0.0                  0.0   
3                         99999999.0            0.0                  0.0   
4                         99999999.0            0.0                  0.0   
...                              ...            ...                  ...   
1039027                   99999999.0            0.0                  0.0   
1039028                   99999999.0            0.0                  0.0   
1039029                   99999999.0            0.0                  0.0   
1039030                   99999999.0            0.0                  0.0   
1039031                   99999999.0            0.0                  0.0   

         prd_kaihatsusha_cd  saitei_chinretsu_su  saitei_chinretsu_su_shoki  \
0                       0.0                    0                          0   
1                       0.0                    0                          0   
2                       0.0                    0                          0   
3                       0.0                    0                          0   
4                       0.0                    0                          0   
...                     ...                  ...                        ...   
1039027                 0.0                    0                          0   
1039028                 0.0                    0                          0   
1039029                 0.0                    0                          0   
1039030                 0.0                    0                          0   
1039031                 0.0                    0                          0   

         price_card_kbn  maker_kibo_kouri_kn  neire_chk_kbn  pkg_baika_flg  \
0                     2                    0              0            0.0   
1                     2                    0              0            0.0   
2                     4                    0              0            0.0   
3                     4                    0              0            0.0   
4                     4                    0              0            0.0   
...                 ...                  ...            ...            ...   
1039027               2                    0              0            0.0   
1039028               2                    0              0            0.0   
1039029               2                    0              0            0.0   
1039030               2                    0              0            0.0   
1039031               2                    0              0            0.0   

         shohi_zei_kbn  shohi_zei_rt  saitei_hacchu_su  \
0                    0            10                10   
1                    0            10                10   
2                    0            10                10   
3                    0            10                 1   
4                    0            10                 1   
...                ...           ...               ...   
1039027              0            10                 1   
1039028              0            10                 2   
1039029              0             8                 1   
1039030              0            10                 1   
1039031              0            10                 1   

         container_sekisai_shu_nm  hoken_kn  hoken_kn_rt  \
0                             NaN       0.0          0.0   
1                             NaN       0.0          0.0   
2                             NaN       0.0          0.0   
3                             NaN       0.0          0.0   
4                             NaN       0.0          0.0   
...                           ...       ...          ...   
1039027                       NaN       0.0          0.0   
1039028                       NaN       0.0          0.0   
1039029                       NaN       NaN          NaN   
1039030                       NaN       0.0          0.0   
1039031                       NaN       0.0          0.0   

         bt_dec_kn_imp_dec_kn  toriatsukai_kn_zochi_kn  kensa_kn  \
0                         0.0                      0.0       0.0   
1                         0.0                      0.0       0.0   
2                         0.0                      0.0       0.0   
3                         0.0                      0.0       0.0   
4                         0.0                      0.0       0.0   
...                       ...                      ...       ...   
1039027                   0.0                      0.0       0.0   
1039028                   0.0                      0.0       0.0   
1039029                   NaN                      NaN       NaN   
1039030                   0.0                      0.0       0.0   
1039031                   0.0                      0.0       0.0   

         lc_charge_do  container_sekisai_m3  freight_d  cy_charge  dray  \
0                 0.0                   0.0        0.0        0.0   0.0   
1                 0.0                   0.0        0.0        0.0   0.0   
2                 0.0                   0.0        0.0        0.0   0.0   
3                 0.0                   0.0        0.0        0.0   0.0   
4                 0.0                   0.0        0.0        0.0   0.0   
...               ...                   ...        ...        ...   ...   
1039027           0.0                   0.0        0.0        0.0   0.0   
1039028           0.0                   0.0        0.0        0.0   0.0   
1039029           NaN                   NaN        NaN        NaN   NaN   
1039030           0.0                   0.0        0.0        0.0   0.0   
1039031           0.0                   0.0        0.0        0.0   0.0   

         container_nioroshi_kn  butsuryo_chinryo_rt  old_fob_tanka_d  \
0                          0.0                  0.0              0.0   
1                          0.0                  0.0              0.0   
2                          0.0                  0.0              0.0   
3                          0.0                  0.0              0.0   
4                          0.0                  0.0              0.0   
...                        ...                  ...              ...   
1039027                    0.0                  0.0              0.0   
1039028                    0.0                  0.0              0.0   
1039029                    NaN                  NaN              NaN   
1039030                    0.0                  0.0              0.0   
1039031                    0.0                  0.0              0.0   

         new_fob_tanka_d  kanzei_rt  inner_iri_su  master_carton_iri_su  \
0                    0.0        0.0           0.0                   0.0   
1                    0.0        0.0           0.0                   0.0   
2                    0.0        0.0           0.0                   0.0   
3                    0.0        0.0           0.0                   0.0   
4                    0.0        0.0           0.0                   0.0   
...                  ...        ...           ...                   ...   
1039027              0.0        0.0           0.0                   0.0   
1039028              0.0        0.0           0.0                   0.0   
1039029              NaN        NaN           NaN                   NaN   
1039030              0.0        0.0           0.0                   0.0   
1039031              0.0        0.0           0.0                   0.0   

         caron_size_1c_ssize_cm_tate  caron_size_1c_ssize_cm_yoko  \
0                                0.0                          0.0   
1                                0.0                          0.0   
2                                0.0                          0.0   
3                                0.0                          0.0   
4                                0.0                          0.0   
...                              ...                          ...   
1039027                          0.0                          0.0   
1039028                          0.0                          0.0   
1039029                          NaN                          NaN   
1039030                          0.0                          0.0   
1039031                          0.0                          0.0   

         caron_size_1c_ssize_cm_h  prd_kn_yobi  maker_shiire_tanka  \
0                             0.0            0                   0   
1                             0.0            0                   0   
2                             0.0            0                   0   
3                             0.0            0                   0   
4                             0.0            0                   0   
...                           ...          ...                 ...   
1039027                       0.0            0                   0   
1039028                       0.0            0                   0   
1039029                       NaN            0                   0   
1039030                       0.0            0                   0   
1039031                       0.0            0                   0   

         nonyu_youbi_kbn  kaigai_chozai_kigen_nissu  processing_center_kbn  \
0                      0                          0                      0   
1                      0                          0                      0   
2                      0                          0                      0   
3                      0                          0                      0   
4                      0                          0                      0   
...                  ...                        ...                    ...   
1039027                0                          0                      0   
1039028                0                          0                      0   
1039029                0                          0                      0   
1039030                0                          0                      0   
1039031                0                          0                      0   

         prd_grp_kbn  shomi_kikan_nissu  mikiribi_nissu  saitei_case_su  \
0                  0                  0               0               0   
1                  0                  0               0               0   
2                  0                  0               0               0   
3                  0                  0               0               0   
4                  0                  0               0               0   
...              ...                ...             ...             ...   
1039027            0                  0               0               0   
1039028            0                  0               0               0   
1039029            0                  0               0               0   
1039030            0                  0               0               0   
1039031            0                  0               0               0   

         shibai_flg  sts_cd  sakujo_kbn  sakujo_shiji_ymd  season_color_nendo  \
0                 0       2           0                 0                 NaN   
1                 0       2           0                 0                 NaN   
2                 0       2           0                 0                 NaN   
3                 0       2           0                 0                 NaN   
4                 0       2           0                 0                 NaN   
...             ...     ...         ...               ...                 ...   
1039027           0       2           0                 0                 NaN   
1039028           0       2           0                 0                 NaN   
1039029           0       3           1          20150514                 NaN   
1039030           0       2           0                 0                 NaN   
1039031           0       2           0                 0                 NaN   

         color_season_cd  prd_size_koso_h  prd_size_koso_w  prd_size_koso_d  \
0                    NaN              NaN              NaN              NaN   
1                    NaN              NaN              NaN              NaN   
2                    NaN              NaN              NaN              NaN   
3                    NaN              NaN              NaN              NaN   
4                    NaN              NaN              NaN              NaN   
...                  ...              ...              ...              ...   
1039027              NaN              NaN              NaN              NaN   
1039028              NaN              NaN              NaN              NaN   
1039029              NaN              NaN              NaN              NaN   
1039030              NaN              NaN              NaN              NaN   
1039031              NaN              NaN              NaN              NaN   

         tnw_pack_size_h  tnw_pack_size_w  tnw_pack_size_d  \
0                    NaN              NaN              NaN   
1                    NaN              NaN              NaN   
2                    NaN              NaN              NaN   
3                    NaN              NaN              NaN   
4                    NaN              NaN              NaN   
...                  ...              ...              ...   
1039027              NaN              NaN              NaN   
1039028              NaN              NaN              NaN   
1039029              NaN              NaN              NaN   
1039030              NaN              NaN              NaN   
1039031              NaN              NaN              NaN   

         pallet_tsumitsuke_su  pallet_tsumitsuke_kon_su  \
0                         NaN                       NaN   
1                         NaN                       NaN   
2                         NaN                       NaN   
3                         NaN                       NaN   
4                         0.0                       0.0   
...                       ...                       ...   
1039027                   NaN                       NaN   
1039028                   NaN                       NaN   
1039029                   0.0                       0.0   
1039030                   NaN                       NaN   
1039031                   NaN                       NaN   

         pallet_tsumitsuke_dan_su  pallet_so_juryo  prd_kigen_taisho_flg  \
0                             NaN              NaN                     1   
1                             NaN              NaN                     1   
2                             NaN              NaN                     1   
3                             NaN              NaN                     0   
4                             0.0              0.0                     1   
...                           ...              ...                   ...   
1039027                       NaN              NaN                     0   
1039028                       NaN              NaN                     0   
1039029                       0.0              0.0                     0   
1039030                       NaN              NaN                     0   
1039031                       NaN              NaN                     0   

         kijun_cd  kijun_kikan  prd_toroku_ymd  prd_toroku_hms  pop_hakko_kbn  \
0             1.0         30.0        19930622               0            0.0   
1             1.0         30.0        19930622               0            0.0   
2             1.0         30.0        20200909           35406            0.0   
3             NaN          0.0        19930622               0            0.0   
4             1.0         30.0        19930622               0            0.0   
...           ...          ...             ...             ...            ...   
1039027       NaN          0.0        19930622               0            0.0   
1039028       NaN          0.0        19930622               0            0.0   
1039029       NaN          NaN        20070808          134833            0.0   
1039030       NaN          NaN        19930622               0            0.0   
1039031       NaN          NaN        19960919          120000            0.0   

         pop_out_trgt_flg pop_catch_copy  sz_inf pop_comment1 pop_comment2  \
0                     NaN            NaN     NaN          NaN          NaN   
1                     0.0            NaN     NaN          NaN          NaN   
2                     0.0            NaN     NaN          NaN          NaN   
3                     0.0            NaN     NaN          NaN          NaN   
4                     0.0            NaN     NaN          NaN          NaN   
...                   ...            ...     ...          ...          ...   
1039027               0.0            NaN     NaN          NaN          NaN   
1039028               0.0            NaN     NaN          NaN          NaN   
1039029               0.0            NaN     NaN          NaN          NaN   
1039030               0.0            NaN     NaN          NaN          NaN   
1039031               2.0            NaN     NaN          NaN          NaN   

        pop_kino01 pop_kino02 pop_kino03 pop_kino04 pop_kino05 pop_kino06  \
0              NaN        NaN        NaN        NaN        NaN        NaN   
1              NaN        NaN        NaN        NaN        NaN        NaN   
2              NaN        NaN        NaN        NaN        NaN        NaN   
3              NaN        NaN        NaN        NaN        NaN        NaN   
4              NaN        NaN        NaN        NaN        NaN        NaN   
...            ...        ...        ...        ...        ...        ...   
1039027        NaN        NaN        NaN        NaN        NaN        NaN   
1039028        NaN        NaN        NaN        NaN        NaN        NaN   
1039029        NaN        NaN        NaN        NaN        NaN        NaN   
1039030        NaN        NaN        NaN        NaN        NaN        NaN   
1039031        NaN        NaN        NaN        NaN        NaN        NaN   

        pop_kino07 pop_kino08 pop_kino09 pop_kino10  prd_pos_msg_crl_kbn  \
0              NaN        NaN        NaN        NaN                  NaN   
1              NaN        NaN        NaN        NaN                  NaN   
2              NaN        NaN        NaN        NaN                  NaN   
3              NaN        NaN        NaN        NaN                  NaN   
4              NaN        NaN        NaN        NaN                  NaN   
...            ...        ...        ...        ...                  ...   
1039027        NaN        NaN        NaN        NaN                  NaN   
1039028        NaN        NaN        NaN        NaN                  NaN   
1039029        NaN        NaN        NaN        NaN                  NaN   
1039030        NaN        NaN        NaN        NaN                  NaN   
1039031        NaN        NaN        NaN        NaN                  NaN   

         send_trgt_flg  mdp_send_trgt_flg  pmm_toroku_zm_flg  \
0                  0.0                0.0                  0   
1                  0.0                0.0                  0   
2                  0.0                0.0                  0   
3                  0.0                0.0                  0   
4                  0.0                0.0                  0   
...                ...                ...                ...   
1039027            0.0                0.0                  0   
1039028            0.0                0.0                  0   
1039029            NaN                NaN                  0   
1039030            0.0                0.0                  0   
1039031            0.0                0.0                  0   

         pmm_prd_kaiso_toroku_zm_flg  urishikiri_genka_rt  gentanka_riyo_kbn  \
0                                  0                  NaN                NaN   
1                                  0                  NaN                NaN   
2                                  0                  NaN                NaN   
3                                  0                  NaN                NaN   
4                                  0                  NaN                NaN   
...                              ...                  ...                ...   
1039027                            0                  NaN                NaN   
1039028                            0                  NaN                0.0   
1039029                            0                  NaN                0.0   
1039030                            0                  NaN                NaN   
1039031                            0                  NaN                0.0   

         honbu_crl_kbn  vmi_atreg_daihyo_tori_cd  pc_prd_shiji_send_trgt_flg  \
0                    1                       NaN                         0.0   
1                    1                       NaN                         0.0   
2                    1                       NaN                         0.0   
3                    1                       NaN                         0.0   
4                    1                       NaN                         0.0   
...                ...                       ...                         ...   
1039027              1                       NaN                         0.0   
1039028              1                       NaN                         0.0   
1039029              1                       NaN                         NaN   
1039030              1                       NaN                         0.0   
1039031              1                       NaN                         0.0   

         naka_juryo  naka_juryo_tani_cd  tnw_tnpn_size_h  tnw_tnpn_size_w  \
0               0.0                   1            100.0             55.0   
1               0.0                   1             85.0             55.0   
2               0.0                   1             10.0             10.0   
3               NaN                   1             10.0             10.0   
4               NaN                   1              NaN              NaN   
...             ...                 ...              ...              ...   
1039027         0.0                   1            355.0            246.0   
1039028         0.0                   1            125.0            200.0   
1039029         NaN                   1              NaN              NaN   
1039030         NaN                   1            150.0             45.0   
1039031         NaN                   1              NaN              NaN   

         tnw_tnpn_size_d  tnw_case_size_h  tnw_case_size_w  tnw_case_size_d  \
0                   22.0              NaN              NaN              NaN   
1                   22.0              NaN              NaN              NaN   
2                   10.0              NaN              NaN              NaN   
3                   10.0              NaN              NaN              NaN   
4                    NaN              NaN              NaN              NaN   
...                  ...              ...              ...              ...   
1039027            246.0              NaN              NaN              NaN   
1039028             80.0              NaN              NaN              NaN   
1039029              NaN              NaN              NaN              NaN   
1039030             45.0              NaN              NaN              NaN   
1039031              NaN              NaN              NaN              NaN   

         hook_ichi_x  hook_ichi_y  prd_juryo  prd_juryo_tani_cd  \
0                NaN          NaN       27.0                  2   
1                NaN          NaN       21.0                  2   
2                NaN          NaN       10.0                  2   
3                NaN          NaN       10.0                  2   
4                NaN          NaN        NaN                  2   
...              ...          ...        ...                ...   
1039027          NaN          NaN     1800.0                  2   
1039028          NaN          NaN      500.0                  2   
1039029          NaN          NaN        NaN                  2   
1039030          NaN          NaN      200.0                  2   
1039031          NaN          NaN        NaN                  2   

         frm_box_irisu  seisan_kojo_cd nb_maker_nm prd_sts_shikibetsu_kigo  \
0                  NaN             NaN         NaN                     NaN   
1                  NaN             NaN         NaN                     NaN   
2                  NaN             NaN          ＪＴ                     NaN   
3                  NaN             NaN         NaN                     NaN   
4                  NaN             NaN         NaN                     NaN   
...                ...             ...         ...                     ...   
1039027            NaN             NaN         NaN                     NaN   
1039028            NaN             NaN         エレス                     NaN   
1039029            NaN             NaN         NaN                     NaN   
1039030            NaN             NaN         キシマ                     NaN   
1039031            NaN             NaN         NaN                     NaN   

         prd_rank  tokushu_konpo_kbn cust_prd_no  hosho_kbn  hosho_kikan  \
0            11.0                0.0         NaN        NaN          NaN   
1             NaN                0.0         NaN        NaN          NaN   
2             NaN                0.0         NaN        NaN          NaN   
3            11.0                0.0         NaN        NaN          NaN   
4            11.0                0.0         NaN        NaN          NaN   
...           ...                ...         ...        ...          ...   
1039027      11.0                0.0         NaN        1.0          4.0   
1039028       5.0                0.0         NaN        1.0          3.0   
1039029       NaN                0.0         NaN        NaN          NaN   
1039030       NaN                0.0         NaN        NaN          NaN   
1039031       NaN                0.0         NaN        NaN          NaN   

         horei_kikaku_kbn  tokkyoken_shinsei_ymd  tokkyoken_toroku_ymd  \
0                     NaN                    NaN                   NaN   
1                     NaN                    NaN                   NaN   
2                     NaN                    NaN                   NaN   
3                     NaN                    NaN                   NaN   
4                     NaN                    NaN                   NaN   
...                   ...                    ...                   ...   
1039027               NaN                    NaN                   NaN   
1039028               NaN                    NaN                   NaN   
1039029               NaN                    NaN                   NaN   
1039030               NaN                    NaN                   NaN   
1039031               NaN                    NaN                   NaN   

         jitsuyo_shinanken_shinsei_ymd  jitsuyo_shinanken_toroku_ymd  \
0                                  NaN                           NaN   
1                                  NaN                           NaN   
2                                  NaN                           NaN   
3                                  NaN                           NaN   
4                                  NaN                           NaN   
...                                ...                           ...   
1039027                            NaN                           NaN   
1039028                            NaN                           NaN   
1039029                            NaN                           NaN   
1039030                            NaN                           NaN   
1039031                            NaN                           NaN   

         ishoken_shinsei_ymd  ishoken_toroku_ymd  shohyoken_shinsei_ymd  \
0                        NaN                 NaN                    NaN   
1                        NaN                 NaN                    NaN   
2                        NaN                 NaN                    NaN   
3                        NaN                 NaN                    NaN   
4                        NaN                 NaN                    NaN   
...                      ...                 ...                    ...   
1039027                  NaN                 NaN                    NaN   
1039028                  NaN                 NaN                    NaN   
1039029                  NaN                 NaN                    NaN   
1039030                  NaN                 NaN                    NaN   
1039031                  NaN                 NaN                    NaN   

         shohyoken_toroku_ymd          size_chuki  tai_kaju  tai_kaju_tani_cd  \
0                         NaN                 NaN       NaN               NaN   
1                         NaN                 NaN       NaN               NaN   
2                         NaN                 NaN       NaN               NaN   
3                         NaN                 NaN       NaN               NaN   
4                         NaN                 NaN       NaN               NaN   
...                       ...                 ...       ...               ...   
1039027                   NaN                 NaN       NaN               NaN   
1039028                   NaN                 NaN       NaN               NaN   
1039029                   NaN                 NaN       NaN               NaN   
1039030                   NaN  巾４．５ｘ奥４．５ｘ高さ１５（ｃｍ）       NaN               NaN   
1039031                   NaN                 NaN       NaN               NaN   

         pbsb_kaihatsu_kbn  czpos_torikomi_zm_flg  toroku_ymd  toroku_hms  \
0                      NaN                      1    20240510      191347   
1                      NaN                      1    20240813      190919   
2                      NaN                      1    20200930       45059   
3                      NaN                      1    20240916      190610   
4                      NaN                      1    20240807      190750   
...                    ...                    ...         ...         ...   
1039027                NaN                      1    20250807      192415   
1039028                NaN                      1    20250918      194218   
1039029                NaN                      1    20070808      134833   
1039030                NaN                      1    20220712      194944   
1039031                NaN                      1    20190930      100616   

         koshin_ymd  koshin_hms user_id     shori_pg_cd shori_kbn  upd_mng_no  \
0          20240511         748     NaN  MD030C0401_B01         U           4   
1          20240814        1109     NaN  MD030C0110_B01         I           3   
2          20201001         754     NaN  MD030C0401_B01         U           3   
3          20240917        1037     NaN  MD030C0401_B01         U           4   
4          20240813        1145     NaN  MD030C0401_B01         U           4   
...             ...         ...     ...             ...       ...         ...   
1039027    20250808         801     NaN  MD030C0401_B01         U           4   
1039028    20250919         737     NaN  MD030C0110_B01         I           3   
1039029    20200630      120000  MANUAL  MD030C0110_B01         D          59   
1039030    20220713         740     NaN  MD030C0401_B01         U           4   
1039031    20200630      120000  MANUAL  MD030B0101_B01         U           2   

         last_update_unyo_ymd    ins_batch_id                ins_dt_tm  \
0                    20250928  MD090G0103_P01  2022-10-08 00:40:40.000   
1                    20250928  MD090G0103_P01  2024-08-14 00:35:46.000   
2                    20250928  MD090G0103_P01  2017-02-12 00:37:08.000   
3                    20250928  MD090G0103_P01  2018-08-29 00:15:13.000   
4                    20250928  MD090G0103_P01  2014-06-13 02:04:12.000   
...                       ...             ...                      ...   
1039027              20250928  MD090G0103_P01  2024-08-02 00:37:42.000   
1039028              20250928  MD090G0103_P01  2023-07-15 00:30:50.000   
1039029              20250928  MD090G0103_P01  2014-06-13 02:04:12.000   
1039030              20250928  MD090G0103_P01  2017-07-26 00:48:40.000   
1039031              20250928  MD090G0103_P01  2014-08-06 00:33:52.000   

           upd_batch_id                upd_dt_tm  del_flg  del_dt_tm  
0        MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
1        MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
2        MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
3        MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
4        MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
...                 ...                      ...      ...        ...  
1039027  MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
1039028  MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
1039029  MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
1039030  MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
1039031  MD090G0103_P01  2025-09-29 00:32:04.000        0        NaN  
